Revit API Introduction Labs
LabUtils.SharedParamGUID Method
 Get GUID for a given shared param name.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static Guid SharedParamGUID(
	Application app,
	string defGroup,
	string defName
)
Visual Basic (Declaration)
Public Shared Function SharedParamGUID ( _
	app As Application, _
	defGroup As String, _
	defName As String _
) As Guid
Visual C++
public:
static Guid SharedParamGUID(
	Application^ app,
	String^ defGroup,
	String^ defName
)
Parameters
app
Type: Application
Revit application
defGroup
Type: System.String
Definition group name
defName
Type: System.String
Definition name
Return Value
GUID
See Also
LabUtils Class
Labs Namespace